# Demo Notebook for CS411 Project Track 1

Since we do not have an interface for this project because of our focus on the algorithm itself, we put the basic functionalities needed for Project Track 1 here as well as any additional progress we have made for our project.

In [5]:
# Import statements
import crud_operations as co # this imports our crud operations class

## CRUD Operations

This next section shows off our basic CRUD operations. We used a script called `csv_to_db.py` that inputted all of our data (as a CSV) to the MySQL database. Below, we show off some of the different functionality that we have. To see the queries we are using, you can look at `crud_operations.py`.

In [8]:
# First, create an instance we can use that uses SampleQueries db
db = co.MySQLDB("SampleQueries")

In [12]:
# Read current database state
print("This is reading the Questions in our DB:")
for entry in db.read_all_questions():
    print(entry)

This is reading the Questions in our DB:
(1, 'Popular Name')
(2, 'Best Performer')
(3, 'Course Enrollment')
(4, 'test question insert')
(5, 'test question insert')
(6, 'test question insert')
(7, 'test question insert')
(8, 'test question insert')
(9, 'test question insert')
(10, 'test question insert')
(11, 'test question insert')
(12, 'test question insert')

In [15]:
# Read current database queries
print("This is reading the Queries in our DB:")
all_queries = db.read_all_queries()
for entry in all_queries:
    print(entry)

This is reading the Queries in our DB:
(1, 1, 'SELECT Firstname FROM Students WHERE Department="Statistics" AND LastName LIKE \'A%\' ORDER BY FirstName DESC')
(2, 1, '\nSELECT Firstname\nFROM Students\nWHERE Department="Statistics" AND LastName LIKE \'A%\'\nORDER BY FirstName\n')
(3, 2, " Select NetId from Students NATURAL JOIN Enrollments where (CRN, Score) in (Select E.CRN, max(Score) From Enrollments E, Courses C Where E.CRN = C.CRN and C.Department = 'CS' Group By E.CRN) AND Students.Department <> 'CS'")
(4, 2, " Select NetID from Enrollments where [CRN, Score] in (Select E.CRN, max(Score) From Enrollments E, Courses C Where E.CRN = C.CRN and C.Department = 'CS' Group By E.CRN))")
(5, 2, "Select temp.CRN, max(temp.Score) from (Select CRN, NetId, Score From Enrollments E NATURAL JOIN Courses C Where C.Department = 'CS') as temp, Students as S Where S.Department <> 'CS'and S.NetId=temp.NetId GROUP BY temp.CRN")
(6, 2, "Select NetId from (Select NetID, CRN, Score from Enrollments where CRN in (Select CRN from Courses where Department = 'CS') ) as temp Where temp.Score = max(temp.Score)")
(7, 2, "\nSelect E.NetId, CRN, E.Score \nfrom Enrollments E NATURAL JOIN Courses C,\nWhere C.Department = 'CS' ")
(8, 1, 'this is a test insert')
(9, 1, 'this is a test insert')
(10, 1, 'this is a test insert')
(11, 0, 'SELECT s.FirstName FROM Students s  WHERE s.LastName LIKE "A%"  AND s.Department="Statistics" ORDER BY s.FirstName desc')
(12, 1, 'SELECT Firstname FROM Students WHERE Department="Statistics" AND LastName LIKE \'A%\' ORDER BY FirstName DESC')
(13, 2, 'SELECT small.NetId FROM ( SELECT c.CRN, MAX(e.Score) as hi_score         FROM Enrollments e, Courses c, Students s         WHERE e.NetId = s.NetId and c.CRN = e.CRN          and c.Department = "CS"         GROUP BY c.CRN) inter   JOIN (SELECT e.NetId, e.CRN, s.Department, e.Score                 FROM Enrollments e, Students s                  WHERE e.NetId=s.NetId                  and s.Department <> "CS"             ) small  ON inter.CRN = small.CRN AND inter.hi_score = small.Score ORDER BY small.NetId asc ')
(14, 3, "Select NetId  from Students NATURAL JOIN Enrollments where (CRN, Score) in (Select E.CRN, max(Score) From Enrollments E, Courses C Where E.CRN = C.CRN and C.Department = 'CS' Group By E.CRN) AND Students.Department <> 'CS'")
(15, 4, 'SELECT DISTINCT s.NetId, FirstName, LastName FROM Students s, Enrollments e  WHERE s.NetId = e.NetId and e.CRN in     (SELECT inter.CRN FROM         (SELECT CRN, COUNT(*) as heads         FROM Enrollments         GROUP BY CRN) inter, Courses c     WHERE inter.heads >= 2 and c.CRN = inter.CRN     and c.Department="CS")')
(16, 5, "Select distinct NetId, FirstName, LastName from Students s natural join Enrollments e where CRN in (select CRN                  from Enrollments e natural join Courses c                 where Department='CS'                 group by CRN                 having count(e.netId) >=2)")
(17, 6, 'SELECT BrandName, COUNT(PurchaseId) as purchase_count FROM (Products prod) LEFT JOIN (Purchases purch) ON prod.ProductId=purch.ProductId GROUP BY BrandName ORDER BY purchase_count desc, BrandName asc')
(18, 7, 'Select p.BrandName as bn, count(pur.PurchaseId) as purc From Products p left outer join Purchases pur on p.ProductId=pur.ProductId group by p.BrandName order by purc desc, bn')
(19, 8, 'SELECT s.FirstName, COUNT(*) as num_ECE_courses FROM (Students s) NATURAL JOIN (Enrollments e), Courses c WHERE e.CRN = c.CRN and c.Department="ECE" GROUP BY s.NetId ORDER BY num_ECE_courses asc, FirstName desc')
(20, 9, "Select s.FirstName as nam, count(e.CRN) as cnt from Students s, Enrollments e, Courses c Where s.netId=e.netId and e.CRN=c.CRN and c.Department='ECE' group by s.FirstName order by cnt, nam desc")
(21, 10, "Select S.FirstName as fn, count(temp.crn) as cnt from (Select S.NetID as net, E.CRN as crn from Students S, Enrollments E, Courses C where S.NetID = E.NetId and E.CRN=C.CRN and C.Department = 'ECE') as temp, Students S where S.NetId=temp.net group by temp.net order by cnt, fn DESC;")
(22, 11, 'UPDATE Enrollments SET Credits = 4 WHERE CRN = 301;  UPDATE Courses  SET Instructor = "Bell Anderson" WHERE CRN = 301;  INSERT INTO Students (NetId, FirstName, LastName, Department) VALUES ("afro2", "Archer", "Frost", "Music");  INSERT INTO Enrollments (NetId, CRN, Credits, Score) VALUES ("afro2", 301, 4, 96.0);  SELECT e.CRN, c.Title, AVG(score) as avg_score FROM Enrollments e NATURAL JOIN Courses c GROUP BY CRN, Title ORDER BY avg_score desc;')
(23, 12, 'UPDATE Enrollments SET Credits = 4 WHERE CRN=301;   UPDATE Courses SET Instructor = "Anderson Bell" WHERE CRN=301;   INSERT INTO Students VALUES ("afro2", "Archer", "Frost","Music");   INSERT INTO Enrollments VALUES ("afro2", 301, 4, 96.0);  Select C.CRN, C.Title, avg(E.Score) as av from Enrollments E, Courses C Where E.CRN=C.CRN group by C.CRN order by av desc')
(24, 13, ' SELECT P.ProductName, COUNT(P2.ProductId) as num_products FROM (Products P) LEFT OUTER JOIN (Products P2) ON P.BrandName <> P2.BrandName AND      P.YearReleased = P2.YearReleased GROUP BY P.ProductId, P.ProductName ORDER BY P.ProductName asc')
(25, 14, 'Select p1.ProductName as pz, count(p2.ProductName) From Products p1 left outer join Products p2 on p1.YearReleased = p2.YearReleased AND p1.BrandName <> p2.BrandName  Group by p1.ProductName Order by pz')
(26, 15, 'SELECT inter.FirstName, inter.LastName FROM( SELECT DISTINCT FirstName, LastName, c.CustomerId FROM Customers c, Purchases p,     (SELECT ProductId, AVG(Price) as avg_price     FROM Purchases GROUP BY ProductId) temp  WHERE p.ProductId = temp.ProductId      AND c.CustomerId = p.CustomerId     AND p.Price > avg_price ORDER BY c.CustomerId desc) inter ')
(27, 16, 'Select fname, lname from (select distinct  CustomerId as cust, FirstName as fname, LastName as lname from Customers c natural join Purchases p, (select ProductId, avg(Price) as av from Purchases group by ProductId) t1 Where p.productId = t1.productId AND p.Price>t1.av order by CustomerId desc) t2')
(28, 17, 'select haha.fn, haha.ln from (select distinct c.FirstName as fn, c.LastName as ln, c.CustomerId as cid     from  Customers c,      Purchases pur,          (select p.ProductId as id, avg(p.Price) as price         from Purchases p          group by p.productId) as temp where c.customerId = pur.customerId and pur.ProductId = temp.id and pur.Price>temp.price order by c.CustomerId desc) haha;  ')
(29, 18, 'CREATE TRIGGER RepeatPurchase  BEFORE INSERT ON Purchases  FOR EACH ROW  BEGIN     IF (NEW.CustomerId, NEW.ProductId) in (SELECT CustomerId, ProductId FROM Purchases) THEN     SET NEW.Price = NEW.Price*.70;     END IF; END;  INSERT INTO Purchases (PurchaseId, CustomerId, ProductId, Price) VALUES (500, 20, 5, 500);')
(30, 19, 'CREATE TRIGGER before_purchases_insert  BEFORE INSERT  ON Purchases FOR EACH ROW  BEGIN  IF (new.CustomerId, new.ProductId) in (select CustomerId, ProductId from Purchases) THEN  Set new.Price = new.Price - 0.3*new.Price;  END IF;   END;     INSERT into Purchases  Values(500,20,5,500);')
(31, 0, 'SELECT s.FirstName FROM Students s  WHERE s.LastName LIKE "A%"  AND s.Department="Statistics" ORDER BY s.FirstName desc')
(32, 1, 'SELECT Firstname FROM Students WHERE Department="Statistics" AND LastName LIKE \'A%\' ORDER BY FirstName DESC')
(33, 2, 'SELECT small.NetId FROM ( SELECT c.CRN, MAX(e.Score) as hi_score         FROM Enrollments e, Courses c, Students s         WHERE e.NetId = s.NetId and c.CRN = e.CRN          and c.Department = "CS"         GROUP BY c.CRN) inter   JOIN (SELECT e.NetId, e.CRN, s.Department, e.Score                 FROM Enrollments e, Students s                  WHERE e.NetId=s.NetId                  and s.Department <> "CS"             ) small  ON inter.CRN = small.CRN AND inter.hi_score = small.Score ORDER BY small.NetId asc ')
(34, 3, "Select NetId  from Students NATURAL JOIN Enrollments where (CRN, Score) in (Select E.CRN, max(Score) From Enrollments E, Courses C Where E.CRN = C.CRN and C.Department = 'CS' Group By E.CRN) AND Students.Department <> 'CS'")
(35, 4, 'SELECT DISTINCT s.NetId, FirstName, LastName FROM Students s, Enrollments e  WHERE s.NetId = e.NetId and e.CRN in     (SELECT inter.CRN FROM         (SELECT CRN, COUNT(*) as heads         FROM Enrollments         GROUP BY CRN) inter, Courses c     WHERE inter.heads >= 2 and c.CRN = inter.CRN     and c.Department="CS")')
(36, 5, "Select distinct NetId, FirstName, LastName from Students s natural join Enrollments e where CRN in (select CRN                  from Enrollments e natural join Courses c                 where Department='CS'                 group by CRN                 having count(e.netId) >=2)")
(37, 6, 'SELECT BrandName, COUNT(PurchaseId) as purchase_count FROM (Products prod) LEFT JOIN (Purchases purch) ON prod.ProductId=purch.ProductId GROUP BY BrandName ORDER BY purchase_count desc, BrandName asc')
(38, 7, 'Select p.BrandName as bn, count(pur.PurchaseId) as purc From Products p left outer join Purchases pur on p.ProductId=pur.ProductId group by p.BrandName order by purc desc, bn')
(39, 8, 'SELECT s.FirstName, COUNT(*) as num_ECE_courses FROM (Students s) NATURAL JOIN (Enrollments e), Courses c WHERE e.CRN = c.CRN and c.Department="ECE" GROUP BY s.NetId ORDER BY num_ECE_courses asc, FirstName desc')
(40, 9, "Select s.FirstName as nam, count(e.CRN) as cnt from Students s, Enrollments e, Courses c Where s.netId=e.netId and e.CRN=c.CRN and c.Department='ECE' group by s.FirstName order by cnt, nam desc")
(41, 10, "Select S.FirstName as fn, count(temp.crn) as cnt from (Select S.NetID as net, E.CRN as crn from Students S, Enrollments E, Courses C where S.NetID = E.NetId and E.CRN=C.CRN and C.Department = 'ECE') as temp, Students S where S.NetId=temp.net group by temp.net order by cnt, fn DESC;")
(42, 11, 'UPDATE Enrollments SET Credits = 4 WHERE CRN = 301;  UPDATE Courses  SET Instructor = "Bell Anderson" WHERE CRN = 301;  INSERT INTO Students (NetId, FirstName, LastName, Department) VALUES ("afro2", "Archer", "Frost", "Music");  INSERT INTO Enrollments (NetId, CRN, Credits, Score) VALUES ("afro2", 301, 4, 96.0);  SELECT e.CRN, c.Title, AVG(score) as avg_score FROM Enrollments e NATURAL JOIN Courses c GROUP BY CRN, Title ORDER BY avg_score desc;')
(43, 12, 'UPDATE Enrollments SET Credits = 4 WHERE CRN=301;   UPDATE Courses SET Instructor = "Anderson Bell" WHERE CRN=301;   INSERT INTO Students VALUES ("afro2", "Archer", "Frost","Music");   INSERT INTO Enrollments VALUES ("afro2", 301, 4, 96.0);  Select C.CRN, C.Title, avg(E.Score) as av from Enrollments E, Courses C Where E.CRN=C.CRN group by C.CRN order by av desc')
(44, 13, ' SELECT P.ProductName, COUNT(P2.ProductId) as num_products FROM (Products P) LEFT OUTER JOIN (Products P2) ON P.BrandName <> P2.BrandName AND      P.YearReleased = P2.YearReleased GROUP BY P.ProductId, P.ProductName ORDER BY P.ProductName asc')
(45, 14, 'Select p1.ProductName as pz, count(p2.ProductName) From Products p1 left outer join Products p2 on p1.YearReleased = p2.YearReleased AND p1.BrandName <> p2.BrandName  Group by p1.ProductName Order by pz')
(46, 15, 'SELECT inter.FirstName, inter.LastName FROM( SELECT DISTINCT FirstName, LastName, c.CustomerId FROM Customers c, Purchases p,     (SELECT ProductId, AVG(Price) as avg_price     FROM Purchases GROUP BY ProductId) temp  WHERE p.ProductId = temp.ProductId      AND c.CustomerId = p.CustomerId     AND p.Price > avg_price ORDER BY c.CustomerId desc) inter ')
(47, 16, 'Select fname, lname from (select distinct  CustomerId as cust, FirstName as fname, LastName as lname from Customers c natural join Purchases p, (select ProductId, avg(Price) as av from Purchases group by ProductId) t1 Where p.productId = t1.productId AND p.Price>t1.av order by CustomerId desc) t2')
(48, 17, 'select haha.fn, haha.ln from (select distinct c.FirstName as fn, c.LastName as ln, c.CustomerId as cid     from  Customers c,      Purchases pur,          (select p.ProductId as id, avg(p.Price) as price         from Purchases p          group by p.productId) as temp where c.customerId = pur.customerId and pur.ProductId = temp.id and pur.Price>temp.price order by c.CustomerId desc) haha;  ')
(49, 18, 'CREATE TRIGGER RepeatPurchase  BEFORE INSERT ON Purchases  FOR EACH ROW  BEGIN     IF (NEW.CustomerId, NEW.ProductId) in (SELECT CustomerId, ProductId FROM Purchases) THEN     SET NEW.Price = NEW.Price*.70;     END IF; END;  INSERT INTO Purchases (PurchaseId, CustomerId, ProductId, Price) VALUES (500, 20, 5, 500);')
(50, 19, 'CREATE TRIGGER before_purchases_insert  BEFORE INSERT  ON Purchases FOR EACH ROW  BEGIN  IF (new.CustomerId, new.ProductId) in (select CustomerId, ProductId from Purchases) THEN  Set new.Price = new.Price - 0.3*new.Price;  END IF;   END;     INSERT into Purchases  Values(500,20,5,500);')
(51, 0, 'SELECT s.FirstName FROM Students s  WHERE s.LastName LIKE "A%"  AND s.Department="Statistics" ORDER BY s.FirstName desc')
(52, 1, 'SELECT Firstname FROM Students WHERE Department="Statistics" AND LastName LIKE \'A%\' ORDER BY FirstName DESC')
(53, 2, 'SELECT small.NetId FROM ( SELECT c.CRN, MAX(e.Score) as hi_score         FROM Enrollments e, Courses c, Students s         WHERE e.NetId = s.NetId and c.CRN = e.CRN          and c.Department = "CS"         GROUP BY c.CRN) inter   JOIN (SELECT e.NetId, e.CRN, s.Department, e.Score                 FROM Enrollments e, Students s                  WHERE e.NetId=s.NetId                  and s.Department <> "CS"             ) small  ON inter.CRN = small.CRN AND inter.hi_score = small.Score ORDER BY small.NetId asc ')
(54, 3, "Select NetId  from Students NATURAL JOIN Enrollments where (CRN, Score) in (Select E.CRN, max(Score) From Enrollments E, Courses C Where E.CRN = C.CRN and C.Department = 'CS' Group By E.CRN) AND Students.Department <> 'CS'")
(55, 4, 'SELECT DISTINCT s.NetId, FirstName, LastName FROM Students s, Enrollments e  WHERE s.NetId = e.NetId and e.CRN in     (SELECT inter.CRN FROM         (SELECT CRN, COUNT(*) as heads         FROM Enrollments         GROUP BY CRN) inter, Courses c     WHERE inter.heads >= 2 and c.CRN = inter.CRN     and c.Department="CS")')
(56, 5, "Select distinct NetId, FirstName, LastName from Students s natural join Enrollments e where CRN in (select CRN                  from Enrollments e natural join Courses c                 where Department='CS'                 group by CRN                 having count(e.netId) >=2)")
(57, 6, 'SELECT BrandName, COUNT(PurchaseId) as purchase_count FROM (Products prod) LEFT JOIN (Purchases purch) ON prod.ProductId=purch.ProductId GROUP BY BrandName ORDER BY purchase_count desc, BrandName asc')
(58, 7, 'Select p.BrandName as bn, count(pur.PurchaseId) as purc From Products p left outer join Purchases pur on p.ProductId=pur.ProductId group by p.BrandName order by purc desc, bn')
(59, 8, 'SELECT s.FirstName, COUNT(*) as num_ECE_courses FROM (Students s) NATURAL JOIN (Enrollments e), Courses c WHERE e.CRN = c.CRN and c.Department="ECE" GROUP BY s.NetId ORDER BY num_ECE_courses asc, FirstName desc')
(60, 9, "Select s.FirstName as nam, count(e.CRN) as cnt from Students s, Enrollments e, Courses c Where s.netId=e.netId and e.CRN=c.CRN and c.Department='ECE' group by s.FirstName order by cnt, nam desc")
(61, 10, "Select S.FirstName as fn, count(temp.crn) as cnt from (Select S.NetID as net, E.CRN as crn from Students S, Enrollments E, Courses C where S.NetID = E.NetId and E.CRN=C.CRN and C.Department = 'ECE') as temp, Students S where S.NetId=temp.net group by temp.net order by cnt, fn DESC;")
(62, 11, 'UPDATE Enrollments SET Credits = 4 WHERE CRN = 301;  UPDATE Courses  SET Instructor = "Bell Anderson" WHERE CRN = 301;  INSERT INTO Students (NetId, FirstName, LastName, Department) VALUES ("afro2", "Archer", "Frost", "Music");  INSERT INTO Enrollments (NetId, CRN, Credits, Score) VALUES ("afro2", 301, 4, 96.0);  SELECT e.CRN, c.Title, AVG(score) as avg_score FROM Enrollments e NATURAL JOIN Courses c GROUP BY CRN, Title ORDER BY avg_score desc;')
(63, 12, 'UPDATE Enrollments SET Credits = 4 WHERE CRN=301;   UPDATE Courses SET Instructor = "Anderson Bell" WHERE CRN=301;   INSERT INTO Students VALUES ("afro2", "Archer", "Frost","Music");   INSERT INTO Enrollments VALUES ("afro2", 301, 4, 96.0);  Select C.CRN, C.Title, avg(E.Score) as av from Enrollments E, Courses C Where E.CRN=C.CRN group by C.CRN order by av desc')
(64, 13, ' SELECT P.ProductName, COUNT(P2.ProductId) as num_products FROM (Products P) LEFT OUTER JOIN (Products P2) ON P.BrandName <> P2.BrandName AND      P.YearReleased = P2.YearReleased GROUP BY P.ProductId, P.ProductName ORDER BY P.ProductName asc')
(65, 14, 'Select p1.ProductName as pz, count(p2.ProductName) From Products p1 left outer join Products p2 on p1.YearReleased = p2.YearReleased AND p1.BrandName <> p2.BrandName  Group by p1.ProductName Order by pz')
(66, 15, 'SELECT inter.FirstName, inter.LastName FROM( SELECT DISTINCT FirstName, LastName, c.CustomerId FROM Customers c, Purchases p,     (SELECT ProductId, AVG(Price) as avg_price     FROM Purchases GROUP BY ProductId) temp  WHERE p.ProductId = temp.ProductId      AND c.CustomerId = p.CustomerId     AND p.Price > avg_price ORDER BY c.CustomerId desc) inter ')
(67, 16, 'Select fname, lname from (select distinct  CustomerId as cust, FirstName as fname, LastName as lname from Customers c natural join Purchases p, (select ProductId, avg(Price) as av from Purchases group by ProductId) t1 Where p.productId = t1.productId AND p.Price>t1.av order by CustomerId desc) t2')
(68, 17, 'select haha.fn, haha.ln from (select distinct c.FirstName as fn, c.LastName as ln, c.CustomerId as cid     from  Customers c,      Purchases pur,          (select p.ProductId as id, avg(p.Price) as price         from Purchases p          group by p.productId) as temp where c.customerId = pur.customerId and pur.ProductId = temp.id and pur.Price>temp.price order by c.CustomerId desc) haha;  ')
(69, 18, 'CREATE TRIGGER RepeatPurchase  BEFORE INSERT ON Purchases  FOR EACH ROW  BEGIN     IF (NEW.CustomerId, NEW.ProductId) in (SELECT CustomerId, ProductId FROM Purchases) THEN     SET NEW.Price = NEW.Price*.70;     END IF; END;  INSERT INTO Purchases (PurchaseId, CustomerId, ProductId, Price) VALUES (500, 20, 5, 500);')
(70, 19, 'CREATE TRIGGER before_purchases_insert  BEFORE INSERT  ON Purchases FOR EACH ROW  BEGIN  IF (new.CustomerId, new.ProductId) in (select CustomerId, ProductId from Purchases) THEN  Set new.Price = new.Price - 0.3*new.Price;  END IF;   END;     INSERT into Purchases  Values(500,20,5,500);')
(71, 0, 'SELECT s.FirstName FROM Students s  WHERE s.LastName LIKE "A%"  AND s.Department="Statistics" ORDER BY s.FirstName desc')
(72, 1, 'SELECT Firstname FROM Students WHERE Department="Statistics" AND LastName LIKE \'A%\' ORDER BY FirstName DESC')
(73, 2, 'SELECT small.NetId FROM ( SELECT c.CRN, MAX(e.Score) as hi_score         FROM Enrollments e, Courses c, Students s         WHERE e.NetId = s.NetId and c.CRN = e.CRN          and c.Department = "CS"         GROUP BY c.CRN) inter   JOIN (SELECT e.NetId, e.CRN, s.Department, e.Score                 FROM Enrollments e, Students s                  WHERE e.NetId=s.NetId                  and s.Department <> "CS"             ) small  ON inter.CRN = small.CRN AND inter.hi_score = small.Score ORDER BY small.NetId asc ')
(74, 3, "Select NetId  from Students NATURAL JOIN Enrollments where (CRN, Score) in (Select E.CRN, max(Score) From Enrollments E, Courses C Where E.CRN = C.CRN and C.Department = 'CS' Group By E.CRN) AND Students.Department <> 'CS'")
(75, 4, 'SELECT DISTINCT s.NetId, FirstName, LastName FROM Students s, Enrollments e  WHERE s.NetId = e.NetId and e.CRN in     (SELECT inter.CRN FROM         (SELECT CRN, COUNT(*) as heads         FROM Enrollments         GROUP BY CRN) inter, Courses c     WHERE inter.heads >= 2 and c.CRN = inter.CRN     and c.Department="CS")')

In [16]:
print("Number of queries:", len(all_queries))

Number of queries: 114

We can also insert into the database by creating another question or query.

In [17]:
print("This is inserting a new Question")
db.create_question("What is our professors name?")

This is inserting a new Question
Inserted the question: What is our professors name?

In [18]:
# We can check by using our read functionality
for entry in db.read_all_questions():
    print(entry)

(1, 'Popular Name')
(2, 'Best Performer')
(3, 'Course Enrollment')
(4, 'test question insert')
(5, 'test question insert')
(6, 'test question insert')
(7, 'test question insert')
(8, 'test question insert')
(9, 'test question insert')
(10, 'test question insert')
(11, 'test question insert')
(12, 'test question insert')
(14, 'What is our professors name?')

In [20]:
# If we do the same for queries, we can see we get an additional query in the DB
db.create_query(1, "SELECT teacherName FROM teachers WHERE teacherName = 'Abdu'") # adds query for question 1

Inserted "SELECT teacherName FROM teachers WHERE teacherName = 'Abdu'" for question 1

In [21]:
new_all_queries = db.read_all_queries()
print("Number of queries:", len(new_all_queries)) # Should be 1 more than last time we looked

Number of queries: 115